app/controllers/authentications_controller.rb

SELECT  "authentications".* FROM "authentications"  WHERE "authentications"."provider" = 'twitter' AND "authentications"."uid" = '483993846' LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 97]]
INSERT INTO "authentications" ("created_at", "provider", "token", "token_secret", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-10-03 08:56:36.411847"], ["email", "uxzgyflr@gmail.com"], ["updated_at", "2014-10-03 08:56:36.411847"]]
---
  def twitter
    omni = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omni['provider'], omni['uid'])
    if authentication
      flash[:notice] = "Logged in Successfully"
      sign_in_and_redirect User.find(authentication.user_id)
    elsif current_user
      token = omni['credentials'].token
      token_secret = omni['credentials'].secret
      current_user.authentications.create!(:provider => omni['provider'], :uid => omni['uid'], :token => token, :token_secret => token_secret)

SELECT  "authentications".* FROM "authentications"  WHERE "authentications"."provider" = 'facebook' AND "authentications"."uid" = '783376665054638' LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 96]]
INSERT INTO "authentications" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-10-02 05:55:02.635729"], ["updated_at", "2014-10-02 05:55:02.635729"], ["user_id", 1]]
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-10-02 05:55:02.626472"], ["email", "prasantakumarswain37@gmail.com"], ["updated_at", "2014-10-02 05:55:02.626472"]]
---
  def facebook
    omni = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omni['provider'], omni['uid'])
    if authentication
      flash[:notice] = "Logged in Successfully"
      sign_in_and_redirect User.find(authentication.user_id)
    elsif current_user
      token = omni['credentials'].token
      token_secret = ""
      current_user.authentications.create!(:provider => omni['provider'], :uid => omni['uid'], :token => token, :token_secret => token_secret)