app/controllers/messages_controller.rb

  def create
    @message = current_user.messages.new(message_params)
    if @message.save!
---
INSERT INTO "messages" ("created_at", "phone", "sms", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-10-03 10:59:55.037806"], ["phone", "+919886312331"], ["sms", "hi"], ["updated_at", "2014-10-03 10:59:55.037806"], ["user_id", 4]]